
SET NAMES UTF8;
DROP DATABASE IF EXISTS product;
CREATE DATABASE product CHARSET=UTF8;
USE product;

/**用户信息**/
CREATE TABLE user(
  uid INT PRIMARY KEY AUTO_INCREMENT,
  uname VARCHAR(32),
  upwd VARCHAR(32),
  email VARCHAR(64),
  phone VARCHAR(16),
  birthday date,
  avatar VARCHAR(128),        #头像图片路径
  user_name VARCHAR(32),      #用户名，如王小明
  gender INT                  #性别  2-女  1-男
);
/**用户信息**/
INSERT INTO user VALUES
(NULL, 'dingding', '123456', 'ding@qq.com', '13501234567', '1962-01-02','', '丁伟', '1'),
(NULL, 'dangdang', '123456', 'dang@qq.com', '13501234568', '1962-01-02','' , '林当', '1'),
(NULL, 'doudou', '123456', 'dou@qq.com', '13501234569', '1962-01-02','', '窦志强', '1'),
(NULL, 'yaya', '123456', 'ya@qq.com', '13501234560', '1962-01-02','', '秦小雅', '0');

#产品种类表
CREATE TABLE `category`(
  `category_id` int(11) NOT NULL,  #种类编号
  `category_name` varchar(24) DEFAULT NULL #种类名称
); 
#drop table category;
INSERT INTO category values
(1,'巴西松子'),
(2,'长白山松子'),
(3,'新疆松子'),
(4,'大兴安岭松子'),
(5,'黑龙江松子');

#品牌表
CREATE TABLE `band`(
  `band_id` int(11) NOT NULL,  #品牌编号
  `band_name` varchar(24) DEFAULT NULL #品牌名称
); 
#drop table band;
INSERT INTO band VALUES
(1,'良品铺子'),
(2,'百草味'),
(3,'楼兰蜜语'),
(4,'口水娃'),
(5,'考拉兄弟');

#口味表
CREATE TABLE `taste`(
  `taste_id` int(11) NOT NULL,  #口味编号
  `taste_name` varchar(24) DEFAULT NULL #口味名称
); 
#drop table taste;
INSERT INTO taste VALUES
(1,'原味'),
(2,'奶油'),
(3,'咸香'),
(4,'椒盐'),
(5,'炭烧'),
(6,'五香'),
(7,'香辣'),
(8,'混合'),
(9,'盐焗'),
(10,'绿茶');

CREATE TABLE `pack`(
  `pack_id` int(11) NOT NULL,  #包装编号
  `pack_name` varchar(24) DEFAULT NULL #包装名称
); 
#drop table pack;
INSERT INTO pack VALUES
(1,'手袋单人份'),
(2,'礼盒双人份'),
(3,'全家福礼包');

--
-- 表的结构 `product`
--



CREATE TABLE `product` (
  `lid` int(11) NOT NULL, #产品编号
  `band_id` int(11) NOT NULL,  #品牌编号
  `category_id` int(11) NOT NULL,#种类编号
  `taste_id` int(11) NOT NULL,#口味编号
  `pack_id` int(11) NOT NULL,#包装编号
                               
  `title` varchar(128) DEFAULT NULL, #主标题
  `subtitle` varchar(128) DEFAULT NULL,#副标题
  `sales` decimal(10,2) DEFAULT NULL,#促销价格
  `price` decimal(10,2) DEFAULT NULL,#原始价格
  `promise` varchar(64) DEFAULT NULL,#服务承诺
  `lname` varchar(32) DEFAULT NULL,#商品名称
  `burdening` varchar(32) DEFAULT NULL,#配料
  `material` varchar(32) DEFAULT NULL,#原料产地
  `spec` varchar(32) DEFAULT NULL,#产品规格
  `yield` varchar(32) DEFAULT NULL,#产地
  `expire` varchar(32) DEFAULT NULL,#保质期
  `standard` varchar(32) DEFAULT NULL, #产品标准号
  `licence` varchar(32) DEFAULT NULL,  #生产许可证编号
  `details` varchar(1024) DEFAULT NULL,  #商品详情
  `shelf_time` varchar(32) DEFAULT NULL,  #上架时间
  `sold_count` int(11) DEFAULT NULL,  #售出数量
  `reserve` varchar(32) DEFAULT NULL,  #储存方法
  `is_onsale` tinyint(1) DEFAULT NULL,  #是否促销
   `edible`varchar(32) DEFAULT NULL,   #食用方法
   `inventory` int(11) NOT NULL  #库存数量
);

#drop table product;
--
-- 转存表中的数据 `product`
--

   #产品编号lid 
   #品牌编号band_id
   #种类编号category_id
   #主标题title
   #副标题subtitle
 #促销价格sales
  #原始价格price
 #服务承诺promise
  
#商品名称lname
  #配料burdening
#原料产地material
  #产品规格spec
#产地yield
  #保质期expire
 #产品标准号standard
  #生产许可证编号licence
 #商品详情details
   #上架时间shelf_time
#售出数量sold_count
  #储存方法reserve
 #是否促销is_onsale
  #食用方法edible

  #库存数量 inventory 

INSERT INTO product  VALUES
(1,1,1,1,1, '良品铺子  巴西松子','','66.69', '98.00', '*退货补运费 *30天无忧退货', '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',1,'开袋即食',100),
(2,1,1,2,1, '良品铺子  巴西松子','','51.36', '68.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'干燥',0,'开袋即食',120),
(3,1,1,3,1, '良品铺子  巴西松子','','52.31', '88.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',103),
(4,1,1,4,1, '良品铺子  巴西松子','','52.31', '78.00', '*退货补运费 *30天无忧退货', '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',140),
(5,1,1,5,1, '良品铺子  巴西松子','','166.69','198.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',1,'开袋即食',150),
(6,1,1,6,1, '良品铺子  巴西松子','','151.36','168.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',110),
(7,1,1,6,2, '良品铺子  巴西松子','','152.31','188.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',190),
(8,1,1,1,3, '良品铺子  巴西松子','','152.31','178.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',140),
(9,1,1,2,3,'良品铺子  巴西松子','','266.69','298.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',1,'开袋即食',123),
(10,1,1,3,2, '良品铺子  巴西松子','','251.36','268.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北','180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',124),
(11,1,1,4,3, '良品铺子  巴西松子','','252.31','288.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北','180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',168),
(12,1,1,5,2,'良品铺子  巴西松子','','252.31','278.00','*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北','180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',112);

INSERT INTO product  VALUES
(13, 1,2,2,2, '良品铺子  长白山松子','','66.69', '98.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100,'常温', 1,'开袋即食',130),
(14, 1,2,3,2, '良品铺子  长白山松子','','51.36', '68.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165',  'QS201020120', 'details', '',100, '干燥',0,'开袋即食',150),
(15, 1,2,4,2, '良品铺子  长白山松子','','52.31', '88.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165',  'QS201020120', 'details', '',100, '常温',0,'开袋即食',190),
(16, 1,2,7,2, '良品铺子  长白山松子','','52.31', '78.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165',  'QS201020120', 'details', '',100, '常温',0,'开袋即食',100),
(17, 1,2,8,2, '良品铺子  长白山松子','','166.69', '198.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温', 1,'开袋即食',130),
(18, 1,2,10,2, '良品铺子  长白山松子','','151.36', '168.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',100),
(19, 1,2,2,1, '良品铺子  长白山松子','','152.31', '188.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',150),
(20, 1,2,1,1, '良品铺子  长白山松子','','152.31', '178.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',166),
(21, 1,2,4,3, '良品铺子  长白山松子','','266.69', '298.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100,'常温', 1,'开袋即食',123),
(22, 1,2,7,1, '良品铺子  长白山松子','','251.36', '268.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',146),
(23, 1,2,2,1, '良品铺子  长白山松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',176),
(24, 1,2,3,1, '良品铺子  长白山松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',180);


INSERT INTO product  VALUES
(25, 1,5,1,1, '良品铺子  黑龙江松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(26, 1,5,2,1, '良品铺子  黑龙江松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(27, 1,3,3,2, '良品铺子 新疆松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(28, 1,3,2,3, '良品铺子 新疆松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(29, 1,4,5,1, '良品铺子 大兴安岭松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(30, 1,4,6,2, '良品铺子 大兴安岭松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101),
(31, 1,4,7,1, '良品铺子 大兴安岭松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(32, 1,4,8,2, '良品铺子 大兴安岭松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(33, 2,4,9,1, '百草园 大兴安岭松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(34, 2,4,10,1, '百草园 大兴安岭松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(35, 3,3,5,2, '楼兰蜜语 新疆松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(36, 3,3,6,1, '楼兰蜜语 新疆松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(37, 4,2,3,1, '口水娃 长白山松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',176),
(38, 4,2,1,1, '口水娃 长白山松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',180);

INSERT INTO product  VALUES
(39, 5,2,1,3, '考拉兄弟  长白山松子','','166.69', '198.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温', 1,'开袋即食',130),
(40, 5,2,1,3, '考拉兄弟  长白山松子','','151.36', '168.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',100),
(41, 5,2,2,2, '考拉兄弟  长白山松子','','152.31', '188.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',150),
(42, 5,2,3,2, '考拉兄弟  长白山松子','','152.31', '178.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',166);

INSERT INTO product  VALUES
(43, 5,1,5,3,'考拉兄弟  巴西松子','','52.31', '88.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',103),
(44, 5,1,6,3,'考拉兄弟  巴西松子','','52.31', '78.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g','湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100,'常温',0,'开袋即食',140);

INSERT INTO product  VALUES
(45, 3,5,2,1, '楼兰蜜语 黑龙江松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(46, 3,5,6,3, '楼兰蜜语 黑龙江松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);


INSERT INTO product  VALUES
(47, 2,5,9,1, '百草园 黑龙江松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(48, 2,5,10,1, '百草园 黑龙江松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(49, 3,2,2,1, '楼兰蜜语 长白山松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(50, 3,2,6,2, '楼兰蜜语 长白山松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);

INSERT INTO product  VALUES
(51, 3,4,2,1, '楼兰蜜语 大兴安岭松子','','252.31', '288.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165','QS201020120', 'details', '',100, '常温',0,'开袋即食',102),
(52, 3,4,6,2, '楼兰蜜语 大兴安岭松子','','252.31', '278.00', '*退货补运费 *30天无忧退货',  '松子218g', '进口松子 食用盐','巴基斯坦','210g', '湖北', '180天', 'GB/T 22165', 'QS201020120', 'details', '',100, '常温',0,'开袋即食',101);



CREATE TABLE shoppingcart_item(
  iid INT PRIMARY KEY AUTO_INCREMENT,
  uid int(11), 
  lid int(11),
  count int(11)

);
#drop table shoppingcart_item;



#SELECT y. FROM  product x,taste y WHERE x.taste_id = y.taste_id GROUP BY x.taste_id
#select * from product where band_id=1 and category_id=1



#轮播图

CREATE TABLE `carousel` (
  `cid` int(11) NOT NULL,
  `img` varchar(128) DEFAULT NULL,
  `title` varchar(64) DEFAULT NULL,
  `href` varchar(128) DEFAULT NULL
) 


INSERT INTO `carousel` (`cid`, `img`, `title`, `href`) VALUES
(1, 'images/ad5.jpg', '轮播广告1', 'product_details.html?lid=16'),
(2, 'images/ad6.jpg', '轮播广告2', 'product_details.html?lid=18'),
(3, 'images/ad7.jpg', '轮播广告3', 'product_details.html?lid=40'),
(4, 'images/ad8.jpg', '轮播广告4', 'product_details.html?lid=28');



